"""
最后得到的数组：
[[ 1 4 255 5]
[ 5 255 255 255]
[ 9 10 255 255]]


分析得到需求是： 将c数组中的元素255放到a数组的相同位置上
"""
import numpy as np

a = np.array([
    [1, 4, 2, 5],
    [5, 6, 7, 8],
    [9, 10, 12, 13]
])

c = np.array([
    [8, 7, 255, 6],
    [5, 255, 255, 255],
    [3, 5, 255, 255]
])

# 方式一
print(c == 255)
b = np.array(a)
b[c == 255] = 255
print(a)
print(b)

print("-------------------------------------")
# 方式二
print(a * (c != 255) + 255 * (c == 255))

print("-------------------------------------")

# 方式三
d = np.where(c == 255, c, a)
print(d)
